/*クリック日から中N営業日前を取得する
2025/02/18 ver1.02
・祝休日をミリ秒で格納。
・現在の日付だけを取得(時分秒ミリ秒を切り捨て)
・※getTimeは戻り値ではない。
・普通に圧縮すると空白削られて%DAYMSECの%DがUnicode判定されるので手間だけどfloor使ってる
*/
let debug=true;

//初期化、祝日休日リスト作成
/*
内閣府からDLしたCSV(下記)の過去3年分(*)＋年末年始休業日＋GW休業日の構成
https://www8.cao.go.jp/chosei/shukujitsu/gaiyou.html
(*)2025/01/24現在、PKSHA上のケースIDが3年保持の状況のため過去3年分を格納
新年に入ったら基本更新。
*/

let datelist=["2022-01-01","2022-01-02","2022-01-03","2022-01-10","2022-02-11","2022-02-23","2022-03-21","2022-04-29","2022-05-02","2022-05-03","2022-05-04","2022-05-05","2022-07-18","2022-08-11","2022-09-19","2022-09-23","2022-10-10","2022-11-03","2022-11-23","2022-12-29","2022-12-30","2022-12-31","2023-01-01","2023-01-02","2023-01-03","2023-01-09","2023-02-11","2023-02-23","2023-03-21","2023-04-29","2023-05-02","2023-05-03","2023-05-04","2023-05-05","2023-07-17","2023-08-11","2023-09-18","2023-09-23","2023-10-09","2023-11-03","2023-11-23","2023-12-29","2023-12-30","2023-12-31","2024-01-01","2024-01-02","2024-01-03","2024-01-08","2024-02-11","2024-02-12","2024-02-23","2024-03-20","2024-04-29","2024-05-02","2024-05-03","2024-05-04","2024-05-05","2024-05-06","2024-07-15","2024-08-11","2024-08-12","2024-09-16","2024-09-22","2024-09-23","2024-10-14","2024-11-03","2024-11-04","2024-11-23","2024-12-29","2024-12-30","2024-12-31","2025-01-01","2025-01-02","2025-01-03","2025-01-13","2025-02-11","2025-02-23","2025-02-24","2025-03-20","2025-04-29","2025-05-03","2025-05-04","2025-05-05","2025-05-06","2025-07-21","2025-08-11","2025-09-15","2025-09-23","2025-10-13","2025-11-03","2025-11-23","2025-11-24","2025-12-29","2025-12-30","2025-12-31","2026-01-01","2026-01-02","2026-01-03","2026-01-12","2026-02-11","2026-02-23","2026-03-20","2026-04-29","2026-05-01","2026-05-03","2026-05-04","2026-05-05","2026-05-06","2026-07-20","2026-08-11","2026-09-21","2026-09-22","2026-09-23","2026-10-12","2026-11-03","2026-11-23","2026-12-29","2026-12-30","2026-12-31","2027-01-01","2027-01-02","2027-01-03"];

let lsholiday=[];

for(let i=0;i<datelist.length;i++){
	let temp=new Date();
	//ミリ秒で格納※Date型で格納すると言語の壁による差異発生。
	lsholiday.push(Date.parse(datelist[i]));
}

let DAYMSEC = 86400000; //1日のミリ秒換算

//関数定義
//getBusinessDate関数内で年、月、日を個別に取得し、桁数が1桁の場合は0を追加して調整しています。
//最後に、年、月、日を"/"で結合して指定の書式で日付を返します。
function getBusinessDate(n) {
  
  //let bdate = new Date().setTime(Math.floor((new Date())/DAYMSEC)*DAYMSEC); // 現在の日付だけを取得
  // 現在の日付だけを取得 *時以下を切り捨てるため86400000(24時間のミリ秒換算)で割って余り切り捨て
  let bdate = new Date();
  bdate.setTime(Math.floor(bdate/DAYMSEC)*DAYMSEC);

  let count = -1; // 営業日のカウント ※送信翌日から実施前日までの営業日数のため、同じ日付は-1、一日違いは0
  if(debug)console.log("bdate:%s",bdate);
  if(debug)console.log("count:%d,n:%d",count,n);
  while (count < n) {
	bdate.setDate(bdate.getDate() - 1); // 1日前の日付を設定
	// 祝休日でも、土曜日でも日曜日でもない場合のみカウントを増やす
	if(lsholiday.indexOf(bdate.getTime())<0 && bdate.getDay() !== 0 && bdate.getDay() !== 6) {
	  count++;
	  console.log(bdate);
	}
  }

  let year = bdate.getFullYear(); // 年を取得
  let month = bdate.getMonth() + 1; // 月を取得 (0-11の範囲で取得されるので+1する)
  let day = bdate.getDate(); // 日を取得
  if(debug)console.log("[%s,%s,%s]",year,month,day);
  // 日付の桁数を調整
  if (month < 10) month = "0" + month;
  if (day < 10) day = "0" + day;
  // 出力
  return year + "/" + month + "/" + day;
}

//Nを入力させる
let input = window.prompt("求めたい「中営業日前日数」を入力してください。\n※中営業日前数：送信日翌日から前日までの日数。");
//let input = 5; // 任意の整数

let t = getBusinessDate(input*1);
//console.log(t);

if (navigator.clipboard) {
	navigator.clipboard.writeText(t);
}
var dlg = `【中 `+input+` 営業日前の日付取得完了】 クリップボードにコピーしました。 ` + t;
alert(dlg);

